{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gJ4eHIDAAAAcgMAAAD6CG1vZGVsLnB52gg8bGFtYmRhPhEAAABzAAAAAA==\n", null, null], "arguments": {}, "batch_input_shape": [null, 64, 64, 3], "trainable": true, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "filters": 24, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "filters": 36, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "strides": [2, 2], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "filters": 48, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_4", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"activation": "elu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_5", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "units": 100, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_6", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "units": 50, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_7", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "units": 10, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "elu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}